normal_text = """大家好！冬至阳生，岁回律转。在这辞旧迎新的美好时刻，我在北京向大家致以新年的祝福！

　　2023年，我们接续奋斗、砥砺前行，经历了风雨洗礼，看到了美丽风景，取得了沉甸甸的收获。大家记住了一年的不易，也对未来充满信心。

　　这一年的步伐，我们走得很坚实。疫情防控平稳转段，我国经济持续回升向好，高质量发展扎实推进。现代化产业体系更加健全，一批高端化、智能化、绿色化新型支柱产业快速崛起。粮食生产“二十连丰”，绿水青山成色更足，乡村振兴展现新气象。东北全面振兴谱写新篇，雄安新区拔节生长，长江经济带活力脉动，粤港澳大湾区勇立潮头。中国经济在风浪中强健了体魄、壮实了筋骨。

　　这一年的步伐，我们走得很有力量。经过久久为功的磨砺，中国的创新动力、发展活力勃发奔涌。C919大飞机实现商飞，国产大型邮轮完成试航，神舟家族太空接力，“奋斗者”号极限深潜。国货潮牌广受欢迎，国产新手机一机难求，新能源汽车、锂电池、光伏产品给中国制造增添了新亮色。中国以自强不息的精神奋力攀登，到处都是日新月异的创造。

　　这一年的步伐，我们走得很见神采。成都大运会、杭州亚运会精彩纷呈，体育健儿勇创佳绩。假日旅游人潮涌动，电影市场红红火火，“村超”、“村晚”活力四射，低碳生活渐成风尚，温暖的生活气息、复苏的忙碌劲头，诠释了人们对美好幸福的追求，也展现了一个活力满满、热气腾腾的中国。

　　这一年的步伐，我们走得很显底气。中国是一个伟大的国度，传承着伟大的文明。在这片辽阔的土地上，大漠孤烟、江南细雨，总让人思接千载、心驰神往；黄河九曲、长江奔流，总让人心潮澎湃、豪情满怀。良渚、二里头的文明曙光，殷墟甲骨的文字传承，三星堆的文化瑰宝，国家版本馆的文脉赓续……泱泱中华，历史何其悠久，文明何其博大，这是我们的自信之基、力量之源。

　　中国不仅发展自己，也积极拥抱世界，担当大国责任。我们成功举办中国－中亚峰会、第三届“一带一路”国际合作高峰论坛，一系列主场外交迎来五洲宾朋。我也访问了一些国家，出席了一些国际会议，会晤了不少老朋友、新伙伴，分享中国主张，深化彼此共识。世事变迁，和平发展始终是主旋律，合作共赢始终是硬道理。

　　前行路上，有风有雨是常态。一些企业面临经营压力，一些群众就业、生活遇到困难，一些地方发生洪涝、台风、地震等自然灾害，这些我都牵挂在心。大家不惧风雨、守望相助，直面挑战、攻坚克难，我深受感动。辛勤劳作的农民，埋头苦干的工人，敢闯敢拼的创业者，保家卫国的子弟兵，各行各业的人们都在挥洒汗水，每一个平凡的人都作出了不平凡的贡献！人民永远是我们战胜一切困难挑战的最大依靠。

　　明年是新中国成立75周年。我们要坚定不移推进中国式现代化，完整、准确、全面贯彻新发展理念，加快构建新发展格局，推动高质量发展，统筹好发展和安全。要坚持稳中求进、以进促稳、先立后破，巩固和增强经济回升向好态势，实现经济行稳致远。要全面深化改革开放，进一步提振发展信心，增强经济活力，以更大力度办教育、兴科技、育人才。要继续支持香港、澳门发挥自身优势，在更好融入国家发展大局中保持长期繁荣稳定。祖国统一是历史必然，两岸同胞要携手同心，共享民族复兴的伟大荣光。

　　我们的目标很宏伟，也很朴素，归根到底就是让老百姓过上更好的日子。孩子的抚养教育，年轻人的就业成才，老年人的就医养老，是家事也是国事，大家要共同努力，把这些事办好。现在，社会节奏很快，大家都很忙碌，工作生活压力都很大。我们要营造温暖和谐的社会氛围，拓展包容活跃的创新空间，创造便利舒适的生活条件，让大家心情愉快、人生出彩、梦想成真。

　　当前，世界上还有一些地方处在战火硝烟之中。中国人民深知和平的珍贵，我们愿同国际社会一道，以人类前途为怀、以人民福祉为念，推动构建人类命运共同体，建设更加美好的世界。

　　此时此刻，夜色斑斓，万家灯火。让我们一起，祝愿祖国繁荣昌盛、世界和平安宁！祝愿大家福暖四季、顺遂安康！

　　谢谢大家！"""
  
abnormal_text = """你有这么高速运转的机械进入中国记住我给出的原理
小的时候就是研发人 就是研发这个东西的原理是是阴间政权管着知道为什么有生灵给他运转
先位还有还有专门饲养这个为什么地下产这种东西
它管着它说是五世同堂旗下子孙你以为我跟你闹着玩呢
你不你不你不警察吗黄龙江一派全都带蓝牙王龙江我告我告诉你 在阴间是是那个化名化名小舅亲小舅 赵金兰的那个嫡子嫡孙

咋的 你跟王守义玩的啊
那是我儿子 他都管我叫太祖奶奶 爱因斯基叶赫那拉我是施瓦辛格
我告诉你 他不听命于杜康
我跟你说句肝上的事你不刑警队的吗
他不听命于杜康 为什么
他是韩国人 他属于合作方 合伙人 自己有自己的政权但是你进入亚洲了 这这块牡丹江号称小联合国你触犯了军权就可以抓他
但是你们为了什么 你为了碎银几两啊 还是限制你的数字啊 还是你你定格不了你没有主权你这兵不硬啊 你理论不强你都说不明白你人情世故 你为了几个数字导致你的方向啊
因为什么 这块有交警队的人 我才说这话的天天交警队交警队 你你你干什么工作了你你这军情我分析的我靠古人
到时候你张口管我要军费的时候挺牛逼的没有定向资金你们 你们资金全是佣金就是你那水平 你这活你给我干完了有这个有这笔钱不干完没有
不敢苟同，我认为意大利面就应该拌42号混凝土，因为螺丝钉的长度会直接影响挖据机的扭矩，你往下砸的时候一瞬间会产生大量高能蛋白，对经济的发展以及太平洋都会有严重的核污染，再者说，你根据勾股定理会很容易的知道，人工饲养的东条英鸡是能够捕获野生的三角函数的，也就是说不管秦始皇的横切面是否具有放射性，特朗普的n
次方是否含有沉淀物，都不影响沃尔玛和尔康在南极汇合"""